logs/01_18/new/21_33_t4/benchmark_fillseq.wal_enabled.v400.log
./db_bench --benchmarks=fillseq        --use_existing_db=0          --db=../data/01_18/new/21_33_t4   --wal_dir=../data/01_18/new/21_33_t4     --num=40000000   --num_levels=6   --key_size=20   --value_size=400   --block_size=8192   --cache_size=4294967296   --cache_numshardbits=6   --compression_max_dict_bytes=0   --compression_ratio=0.5   --compression_type=zstd   --level_compaction_dynamic_level_bytes=0   --bytes_per_sync=8388608   --cache_index_and_filter_blocks=0   --pin_l0_filter_and_index_blocks_in_cache=1     --write_buffer_size=134217728   --target_file_size_base=134217728   --max_bytes_for_level_base=536870912   --max_bytes_for_level_multiplier=8     --statistics=0   --stats_per_interval=1   --stats_interval_seconds=60   --histogram=1     --open_files=-1     --max_background_jobs=16   --subcompactions=5   --rate_limiter_bytes_per_sec=419430400   --rate_limiter_auto_tuned=1   --max_compaction_bytes=10737418240           --level0_file_num_compaction_trigger=4            --level0_stop_writes_trigger=20           --max_write_buffer_number=2           --use_multi_thread_write=1        --min_level_to_compress=0        --threads=4        --disable_wal=0        --seed=1610976797        2>&1 | grep -v "... thread" | tee -a ../logs/01_18/new/21_33_t4/benchmark_fillseq.wal_enabled.v400.log
RocksDB:    version 6.4
Date:       Mon Jan 18 21:33:17 2021
CPU:        12 * Intel(R) Core(TM) i7-8700 CPU @ 3.20GHz
CPUCache:   12288 KB

** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     17/8   557.09 MB   2.2      0.4     0.0      0.4       1.2      0.8       0.0   1.5      2.3      6.2    197.54             31.58        65    3.039   2616K   203K
  L1      3/0   203.57 MB   0.4      0.4     0.2      0.2       0.4      0.2       0.0   1.8     25.1     24.4     15.69              7.45         4    3.923   2255K    43K
 Sum     20/8   760.66 MB   0.0      0.8     0.2      0.6       1.6      1.0       0.0   2.0      4.0      7.6    213.23             39.03        69    3.090   4871K   247K
 Int      0/0    0.00 KB   0.0      0.8     0.2      0.6       1.6      1.0       0.0   2.0      4.0      7.6    213.23             39.03        69    3.090   4871K   247K

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0      0.8     0.2      0.6       0.8      0.2       0.0   0.0      6.1      5.8    140.15             19.01        12   11.679   4871K   247K
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.8      0.8       0.0   0.0      0.0     11.1     73.08             20.02        57    1.282       0      0
Uptime(secs): 60.3 total, 60.3 interval
Flush(GB): cumulative 0.789, interval 0.789
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 1.58 GB write, 26.79 MB/s write, 0.83 GB read, 14.17 MB/s read, 213.2 seconds
Interval compaction: 1.58 GB write, 26.80 MB/s write, 0.83 GB read, 14.17 MB/s read, 213.2 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 5 level0_numfiles, 5 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 31 memtable_compaction, 0 memtable_slowdown, interval 36 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 60.3 total, 60.3 interval
Cumulative writes: 17M writes, 17M keys, 8609K commit groups, 2.0 writes per commit group, ingest: 6.81 GB, 115.78 MB/s
Cumulative WAL: 17M writes, 0 syncs, 17014503.00 writes per sync, written: 6.81 GB, 115.78 MB/s
Cumulative stall: 00:00:27.856 H:M:S, 46.2 percent
Interval writes: 17M writes, 17M keys, 8609K commit groups, 2.0 writes per commit group, ingest: 6978.48 MB, 115.81 MB/s
Interval WAL: 17M writes, 0 syncs, 17014503.00 writes per sync, written: 6.81 MB, 115.81 MB/s
Interval stall: 00:00:27.856 H:M:S, 46.2 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      8/5   200.06 MB   0.8      0.9     0.0      0.9       2.1      1.2       0.0   1.7      3.1      6.9    309.12             57.43       104    2.972   5366K   505K
  L1      6/1   457.44 MB   0.8      1.2     1.0      0.2       1.1      0.9       0.0   1.2     24.2     23.1     50.65             35.35         5   10.130   6974K   206K
  L2      5/0   482.84 MB   0.1      0.0     0.0      0.0       0.0      0.0       0.5   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum     19/6    1.11 GB   0.0      2.1     1.0      1.1       3.2      2.1       0.5   2.6      6.0      9.2    359.77             92.78       109    3.301     12M   712K
 Int      0/0    0.00 KB   0.0      1.3     0.8      0.5       1.7      1.1       0.5   3.6      9.0     11.6    146.54             53.75        40    3.664   7469K   464K

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0      2.1     1.0      1.1       2.0      0.8       0.0   0.0      9.2      8.6    235.81             59.46        21   11.229     12M   712K
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       1.3      1.3       0.0   0.0      0.0     10.3    123.96             33.32        88    1.409       0      0
Uptime(secs): 120.4 total, 60.2 interval
Flush(GB): cumulative 1.252, interval 0.463
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 3.23 GB write, 27.46 MB/s write, 2.12 GB read, 18.00 MB/s read, 359.8 seconds
Interval compaction: 1.65 GB write, 28.14 MB/s write, 1.28 GB read, 21.83 MB/s read, 146.5 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 16 level0_numfiles, 16 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 49 memtable_compaction, 0 memtable_slowdown, interval 29 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 120.4 total, 60.2 interval
Cumulative writes: 26M writes, 26M keys, 13M commit groups, 2.0 writes per commit group, ingest: 10.46 GB, 88.90 MB/s
Cumulative WAL: 26M writes, 0 syncs, 26107714.00 writes per sync, written: 10.46 GB, 88.90 MB/s
Cumulative stall: 00:01:10.813 H:M:S, 58.8 percent
Interval writes: 9093K writes, 9093K keys, 4595K commit groups, 2.0 writes per commit group, ingest: 3729.50 MB, 61.98 MB/s
Interval WAL: 9093K writes, 0 syncs, 9093211.00 writes per sync, written: 3.64 MB, 61.98 MB/s
Interval stall: 00:00:42.957 H:M:S, 71.4 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      9/6   263.41 MB   0.8      1.7     0.0      1.7       3.6      1.9       0.0   1.7      3.7      8.1    457.34            101.58       173    2.644   9619K  1057K
  L1      6/1   484.82 MB   0.9      2.0     1.7      0.3       1.9      1.6       0.0   1.1     21.8     20.6     94.77             61.97         8   11.846     11M   496K
  L2     12/0    1.10 GB   0.3      0.0     0.0      0.0       0.0      0.0       1.1   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum     27/7    1.83 GB   0.0      3.7     1.7      2.0       5.5      3.5       1.1   2.6      6.8     10.2    552.11            163.56       181    3.050     21M  1553K
 Int      0/0    0.00 KB   0.0      1.6     0.7      0.8       2.3      1.4       0.6   2.6      8.3     12.1    192.34             70.77        72    2.671   9046K   841K

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0      3.7     1.7      2.0       3.4      1.4       0.0   0.0     10.9     10.0    345.31            104.42        36    9.592     21M  1553K
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       2.1      2.1       0.0   0.0      0.0     10.5    206.80             59.14       145    1.426       0      0
Uptime(secs): 180.4 total, 60.0 interval
Flush(GB): cumulative 2.127, interval 0.875
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 5.50 GB write, 31.23 MB/s write, 3.67 GB read, 20.83 MB/s read, 552.1 seconds
Interval compaction: 2.27 GB write, 38.78 MB/s write, 1.55 GB read, 26.51 MB/s read, 192.3 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 17 level0_numfiles, 17 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 97 memtable_compaction, 0 memtable_slowdown, interval 49 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 180.4 total, 60.0 interval
Cumulative writes: 43M writes, 43M keys, 21M commit groups, 2.0 writes per commit group, ingest: 17.25 GB, 97.87 MB/s
Cumulative WAL: 43M writes, 0 syncs, 43058831.00 writes per sync, written: 17.25 GB, 97.87 MB/s
Cumulative stall: 00:01:37.940 H:M:S, 54.3 percent
Interval writes: 16M writes, 16M keys, 8575K commit groups, 2.0 writes per commit group, ingest: 6952.46 MB, 115.87 MB/s
Interval WAL: 16M writes, 0 syncs, 16951117.00 writes per sync, written: 6.79 MB, 115.87 MB/s
Interval stall: 00:00:27.127 H:M:S, 45.2 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     10/8   268.53 MB   0.5      2.5     0.0      2.5       5.5      3.0       0.0   1.6      4.5      9.8    573.17            147.66       253    2.265     14M  2107K
  L1      7/1   500.64 MB   0.9      3.2     2.7      0.5       3.0      2.4       0.0   1.1     23.8     21.8    139.28             94.79        14    9.949     18M  1329K
  L2     21/0    1.96 GB   0.5      0.0     0.0      0.0       0.0      0.0       2.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum     38/9    2.71 GB   0.0      5.7     2.7      3.0       8.4      5.4       2.0   2.5      8.2     12.1    712.44            242.45       267    2.668     33M  3436K
 Int      0/0    0.00 KB   0.0      2.1     1.0      1.0       2.9      1.9       0.9   2.4     13.2     18.8    160.34             78.89        86    1.864     12M  1882K

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0      5.7     2.7      3.0       5.1      2.1       0.0   0.0     13.7     12.2    429.33            153.90        54    7.951     33M  3436K
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       3.3      3.3       0.0   0.0      0.0     12.1    283.11             88.56       213    1.329       0      0
Uptime(secs): 240.5 total, 60.0 interval
Flush(GB): cumulative 3.340, interval 1.213
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 8.45 GB write, 35.97 MB/s write, 5.74 GB read, 24.44 MB/s read, 712.4 seconds
Interval compaction: 2.94 GB write, 50.22 MB/s write, 2.07 GB read, 35.29 MB/s read, 160.3 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 17 level0_numfiles, 17 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 150 memtable_compaction, 0 memtable_slowdown, interval 53 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 240.5 total, 60.0 interval
Cumulative writes: 62M writes, 62M keys, 31M commit groups, 2.0 writes per commit group, ingest: 25.14 GB, 107.07 MB/s
Cumulative WAL: 62M writes, 0 syncs, 62776432.00 writes per sync, written: 25.14 GB, 107.07 MB/s
Cumulative stall: 00:01:58.678 H:M:S, 49.4 percent
Interval writes: 19M writes, 19M keys, 9987K commit groups, 2.0 writes per commit group, ingest: 8087.27 MB, 134.73 MB/s
Interval WAL: 19M writes, 0 syncs, 19717601.00 writes per sync, written: 7.90 MB, 134.73 MB/s
Interval stall: 00:00:20.738 H:M:S, 34.5 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      4/4   86.04 MB   0.0      3.4     0.0      3.4       7.8      4.4       0.0   1.6      5.2     12.0    665.60            193.65       348    1.913     19M  3451K
  L1      7/1   465.01 MB   0.8      5.5     4.3      1.1       4.8      3.6       0.0   1.1     29.4     25.6    191.05            136.23        28    6.823     31M  3756K
  L2     36/0    3.18 GB   0.8      0.0     0.0      0.0       0.0      0.0       3.2   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum     47/5    3.72 GB   0.0      8.8     4.3      4.5      12.6      8.1       3.2   2.5     10.6     15.0    856.64            329.88       376    2.278     51M  7208K
 Int      0/0    0.00 KB   0.0      3.1     1.6      1.5       4.1      2.6       1.2   2.4     22.1     29.3    144.20             87.43       109    1.323     18M  3771K

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0      8.8     4.3      4.5       7.5      3.0       0.0   0.0     17.8     15.2    507.80            209.74        79    6.428     51M  7208K
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       5.0      5.0       0.0   0.0      0.0     14.7    348.84            120.14       297    1.175       0      0
Uptime(secs): 300.5 total, 60.0 interval
Flush(GB): cumulative 5.024, interval 1.684
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 12.57 GB write, 42.83 MB/s write, 8.85 GB read, 30.14 MB/s read, 856.6 seconds
Interval compaction: 4.12 GB write, 70.32 MB/s write, 3.11 GB read, 53.01 MB/s read, 144.2 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 17 level0_numfiles, 17 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 216 memtable_compaction, 0 memtable_slowdown, interval 66 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 300.5 total, 60.0 interval
Cumulative writes: 87M writes, 87M keys, 44M commit groups, 2.0 writes per commit group, ingest: 35.02 GB, 119.36 MB/s
Cumulative WAL: 87M writes, 0 syncs, 87440400.00 writes per sync, written: 35.02 GB, 119.36 MB/s
Cumulative stall: 00:02:8.582 H:M:S, 42.8 percent
Interval writes: 24M writes, 24M keys, 12M commit groups, 2.0 writes per commit group, ingest: 10116.23 MB, 168.59 MB/s
Interval WAL: 24M writes, 0 syncs, 24663968.00 writes per sync, written: 9.88 MB, 168.59 MB/s
Interval stall: 00:00:9.904 H:M:S, 16.5 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      3/0   73.29 MB   0.8      3.4     0.0      3.4       9.8      6.4       0.0   1.4      4.7     13.8    725.93            229.00       435    1.669     19M  3451K
  L1     10/0   495.99 MB   1.0      8.3     6.4      2.0       6.7      4.7       0.0   1.1     36.2     29.1    235.60            183.74        50    4.712     48M  9031K
  L2     50/0    3.95 GB   1.0      0.0     0.0      0.0       0.0      0.0       4.2   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L3      5/0   300.36 MB   0.0      0.0     0.0      0.0       0.0      0.0       0.3   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum     68/0    4.80 GB   0.0     11.7     6.4      5.3      16.5     11.2       4.5   2.3     12.4     17.6    961.53            412.74       485    1.983     68M    12M
 Int      0/0    0.00 KB   0.0      2.8     2.0      0.8       3.9      3.1       1.4   2.0     27.7     38.3    104.89             82.86       109    0.962     16M  5274K

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     11.7     6.4      5.3       9.5      4.1       0.0   0.0     21.7     17.5    552.35            257.25       101    5.469     68M    12M
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       7.0      7.0       0.0   0.0      0.0     17.6    409.18            155.49       384    1.066       0      0
Uptime(secs): 360.5 total, 60.0 interval
Flush(GB): cumulative 7.032, interval 2.008
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 16.49 GB write, 46.84 MB/s write, 11.69 GB read, 33.20 MB/s read, 961.5 seconds
Interval compaction: 3.92 GB write, 66.94 MB/s write, 2.84 GB read, 48.49 MB/s read, 104.9 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 17 level0_numfiles, 17 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 245 memtable_compaction, 0 memtable_slowdown, interval 29 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 360.5 total, 60.0 interval
Cumulative writes: 113M writes, 113M keys, 57M commit groups, 2.0 writes per commit group, ingest: 45.31 GB, 128.71 MB/s
Cumulative WAL: 113M writes, 0 syncs, 113118582.00 writes per sync, written: 45.31 GB, 128.71 MB/s
Cumulative stall: 00:02:16.883 H:M:S, 38.0 percent
Interval writes: 25M writes, 25M keys, 13M commit groups, 2.0 writes per commit group, ingest: 10532.17 MB, 175.53 MB/s
Interval WAL: 25M writes, 0 syncs, 25678182.00 writes per sync, written: 10.29 MB, 175.53 MB/s
Interval stall: 00:00:8.301 H:M:S, 13.8 percent


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      6/4   152.47 MB   0.5      3.4     0.0      3.4      11.9      8.5       0.0   1.3      4.4     15.5    787.25            265.18       522    1.508     19M  3451K
  L1     10/1   496.52 MB   0.9     11.1     8.4      2.7       8.5      5.8       0.0   1.0     40.8     31.3    278.81            230.16        71    3.927     64M    14M
  L2     50/0    3.95 GB   1.0      0.0     0.0      0.0       0.0      0.0       5.3   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
  L3     26/0    1.34 GB   0.0      0.0     0.0      0.0       0.0      0.0       1.3   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0
 Sum     92/5    5.92 GB   0.0     14.5     8.4      6.1      20.4     14.3       6.6   2.2     13.9     19.6   1066.06            495.33       593    1.798     84M    17M
 Int      0/0    0.00 KB   0.0      2.8     2.0      0.8       3.9      3.1       2.1   1.9     27.3     38.3    104.53             82.59       108    0.968     16M  5445K

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     14.5     8.4      6.1      11.3      5.2       0.0   0.0     24.9     19.4    595.56            303.67       122    4.882     84M    17M
High      0/0    0.00 KB   0.0      0.0     0.0      0.0       9.1      9.1       0.0   0.0      0.0     19.8    470.50            191.67       471    0.999       0      0
Uptime(secs): 420.5 total, 60.0 interval
Flush(GB): cumulative 9.110, interval 2.078
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 20.40 GB write, 49.67 MB/s write, 14.47 GB read, 35.24 MB/s read, 1066.1 seconds
Interval compaction: 3.91 GB write, 66.67 MB/s write, 2.78 GB read, 47.52 MB/s read, 104.5 seconds
Stalls(count): 0 level0_slowdown, 0 level0_slowdown_with_compaction, 17 level0_numfiles, 17 level0_numfiles_with_compaction, 0 stop for pending_compaction_bytes, 0 slowdown for pending_compaction_bytes, 279 memtable_compaction, 0 memtable_slowdown, interval 34 total count

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 420.5 total, 60.0 interval
Cumulative writes: 138M writes, 138M keys, 70M commit groups, 2.0 writes per commit group, ingest: 55.52 GB, 135.21 MB/s
Cumulative WAL: 138M writes, 0 syncs, 138614510.00 writes per sync, written: 55.52 GB, 135.21 MB/s
Cumulative stall: 00:02:25.574 H:M:S, 34.6 percent
Interval writes: 25M writes, 25M keys, 12M commit groups, 2.0 writes per commit group, ingest: 10457.44 MB, 174.28 MB/s
Interval WAL: 25M writes, 0 syncs, 25495928.00 writes per sync, written: 10.21 MB, 174.28 MB/s
Interval stall: 00:00:8.691 H:M:S, 14.5 percent

Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     400 bytes each (200 bytes after compression)
Entries:    40000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    16021.7 MB (estimated)
FileSize:   8392.3 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: ZSTD
Compression sampling rate: 0
Memtablerep: skip_list
Perf Level: 1
WARNING: Assertions are enabled; benchmarks unnecessarily slow
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
DB path: [../data/01_18/new/21_33_t4]
fillseq      :      11.806 micros/op 338666 ops/sec;  135.7 MB/s
Microseconds per write:
Count: 160000000 Average: 11.8063  StdDev: 4.74
Min: 3  Median: 7.5645  Max: 10830800
Percentiles: P50: 7.56 P75: 9.06 P99: 14.82 P99.9: 28.25 P99.99: 58.97
------------------------------------------------------
(       2,       3 ]     7293   0.005%   0.005% 
(       3,       4 ]   490357   0.306%   0.311% 
(       4,       6 ] 37794951  23.622%  23.933% #####
(       6,      10 ] 106635334  66.647%  90.580% #############
(      10,      15 ] 13976274   8.735%  99.315% ##
(      15,      22 ]   837999   0.524%  99.839% 
(      22,      34 ]   187784   0.117%  99.956% 
(      34,      51 ]    49143   0.031%  99.987% 
(      51,      76 ]    15263   0.010%  99.996% 
(      76,     110 ]     2111   0.001%  99.998% 
(     110,     170 ]      431   0.000%  99.998% 
(     170,     250 ]     1173   0.001%  99.999% 
(     250,     380 ]      395   0.000%  99.999% 
(     380,     580 ]       85   0.000%  99.999% 
(     580,     870 ]      114   0.000%  99.999% 
(     870,    1300 ]       33   0.000%  99.999% 
(    1300,    1900 ]       16   0.000%  99.999% 
(    1900,    2900 ]       16   0.000%  99.999% 
(    2900,    4400 ]        7   0.000%  99.999% 
(    4400,    6600 ]        9   0.000%  99.999% 
(    6600,    9900 ]       36   0.000%  99.999% 
(    9900,   14000 ]       16   0.000%  99.999% 
(   14000,   22000 ]       60   0.000%  99.999% 
(   22000,   33000 ]       40   0.000%  99.999% 
(   33000,   50000 ]       36   0.000%  99.999% 
(   50000,   75000 ]       36   0.000%  99.999% 
(   75000,  110000 ]       76   0.000%  99.999% 
(  110000,  170000 ]       64   0.000%  99.999% 
(  170000,  250000 ]      136   0.000% 100.000% 
(  250000,  380000 ]      196   0.000% 100.000% 
(  380000,  570000 ]      196   0.000% 100.000% 
(  570000,  860000 ]      116   0.000% 100.000% 
(  860000, 1200000 ]      116   0.000% 100.000% 
( 1200000, 1900000 ]       68   0.000% 100.000% 
( 1900000, 2900000 ]        8   0.000% 100.000% 
( 4300000, 6500000 ]        4   0.000% 100.000% 
( 6500000, 9800000 ]        4   0.000% 100.000% 
( 9800000, 14000000 ]        4   0.000% 100.000%